# Movies Tonight Part 3: SQL DML

In [27]:
%load_ext sql
%sql sqlite:///Movies.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @Movies.db'

In [28]:
# Loaded the DATASET.csv into the database through the terminal line

2. **Populate the tables with data.**  

    - Use `INSERT ... SELECT ...` queries to extract data from `DATASET` for each table of your other tables. 
    - Start with the strong entities before moving on to the weak ones. Be sure to always select distinct     values. 
    - Foreign Keys get special treatment. You will have to use JOINs to pick up the PKs from the other side of the relationships. (As in Part 1, use the fact that movie names, theater names, and people names are always unique in our source data. That way you can use then for the JOIN columns. 
    - If you have to start over, then rerun your DDL queries from Part 2.

In [29]:
%%sql
INSERT INTO MOVIES (MTitle, Rating)
    SELECT DISTINCT MTitle, Rating
    FROM DATASET;

 * sqlite:///Movies.db
23 rows affected.

[]

In [30]:
%%sql
SELECT * 
    FROM MOVIES;

 * sqlite:///Movies.db
Done.

[(1, 'Associate, The', 'PG-13'),
 (2, 'Ghost & The Darkness, The', 'R'),
 (3, 'Independence Day', 'PG-13'),
 (4, 'D3: The Mighty Ducks', 'PG'),
 (5, 'Dear God', ''),
 (6, 'First Wives Club, The', 'PG-13'),
 (7, 'High School High', 'PG-13'),
 (8, 'Larger Than Life', 'PG'),
 (9, 'Mirror Has Two Faces, The', 'PG-13'),
 (10, 'Ransom', 'R'),
 (11, 'Sleepers', ''),
 (12, 'Space Jam', 'PG'),
 (13, "Stephen King's Thinner", ''),
 (14, 'Michael Collins', 'R'),
 (15, 'Romeo & Juliet', 'R'),
 (16, 'Big Night', 'R'),
 (17, 'Fly Away Home', 'PG'),
 (18, 'Nutty Professor, The', 'PG-13'),
 (19, 'Phenomenon', 'PG'),
 (20, 'Set It Off', 'R'),
 (21, 'Surviving Picasso', 'R'),
 (22, 'Very Brady Sequel, A', 'PG-13'),
 (23, 'That Thing You Do', 'PG')]

In [31]:
%%sql
INSERT INTO Theater (TName, Location, Phone)
    SELECT DISTINCT TName, Location, Phone
    FROM DATASET;

 * sqlite:///Movies.db
9 rows affected.

[]

In [32]:
%%sql
INSERT INTO Artist (ArtistName)
    SELECT DISTINCT CName
    FROM DATASET;

 * sqlite:///Movies.db
153 rows affected.

[]

In [33]:
%%sql 
INSERT INTO CREDITS(MID, AID, CCode)
SELECT DISTINCT MID, AID, CCode
    FROM DATASET
    JOIN MOVIES ON (MOVIES.MTitle=DATASET.MTitle)
    JOIN ARTIST ON (DATASET.CName = Artist.ArtistName);

 * sqlite:///Movies.db
162 rows affected.

[]

In [34]:
%%sql 
INSERT INTO SHOW(MID, TID, STime)
SELECT DISTINCT MID, TID, ShowTime 
    FROM DATASET 
    JOIN MOVIES ON (DATASET.MTitle=Movies.MTitle)
    JOIN THEATER ON (DATASET.TName=THEATER.TName);

 * sqlite:///Movies.db
131 rows affected.

[]

3. **Check your work.**  
There are 9 theaters, 23 movies, 152 artists, 131 shows, and 161 credits.

In [35]:
%%sql 
SELECT COUNT(*)
    FROM MOVIES;
#23

 * sqlite:///Movies.db
Done.

[(23,)]

In [36]:
%%sql 
SELECT COUNT(*)
    FROM THEATER;
#9

 * sqlite:///Movies.db
Done.

[(9,)]

In [37]:
%%sql 
SELECT COUNT(*)
    FROM ARTIST;
#153

 * sqlite:///Movies.db
Done.

[(153,)]

In [38]:
%%sql 
SELECT COUNT(*)
    FROM SHOW;
#131

 * sqlite:///Movies.db
Done.

[(131,)]

In [39]:
%%sql 
SELECT COUNT(*)
    FROM CREDITS;
#162

 * sqlite:///Movies.db
Done.

[(162,)]

4. **Now check the source data.**  
There are actually 13 duplicate rows in the original source data! Can you spot them? Write a SQL query that counts how many times each (MTitle, TName, Showtime, CCode, and CName) appears. Which ones appear more than once?

In [43]:
%%sql
SELECT DISTINCT COUNT(*) 
    FROM DATASET;

 * sqlite:///Movies.db
Done.

[(913,)]

In [44]:
%%sql
SELECT COUNT(*) 
    FROM DATASET;

 * sqlite:///Movies.db
Done.

[(913,)]

5. **Drop the `DATASET` table.**  
We don't need it anymore.

In [45]:
%%sql
DROP TABLE DATASET

 * sqlite:///Movies.db
Done.

[]

6. **Save, commit, and push your work to GitHub.**  
Use the commit summary comment "Completed Part 3".

In [ ]:
# Completed Part 3